# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Utils
brew 'coreutils'
brew 'findutils'
brew 'moreutils'

# Upgrade default command line tools
brew 'bash'
brew 'curl'
brew 'grep'
brew 'wget'

# Install Binaries
brew 'git'
brew 'git-extras'
brew 'mas'                  # Mac App Store CLI
brew 'nvm'
brew 'the_silver_searcher'
brew 'wifi-password'
brew 'yarn'
brew 'pyenv'

# Apps
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'kap'
cask 'keybase'
cask 'postman'
cask 'sequel-pro'
cask 'slack'
cask 'sketch'
cask 'spotify'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Install Mac App Store apps
mas 'Xcode', id: 497799835
